# DBeam_SetBeamAngle

```pascal
PROCEDURE DBeam_SetBeamAngle(angle : REAL);
```

```python
def vs.DBeam_SetBeamAngle(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight